In [26]:
library(tidyr)
library(dplyr)
library(stringr)

In [27]:
options(stringsAsFactors = F)

In [1]:
set.seed(1122)
df <- data.frame(Name = c("John", "Peter", "Mary", "Caroline"),
                DrugA_T1 = runif(4, 35,36),
                DrugA_T2 = runif(4, 36, 39),
                DrugB_T1 = runif(4, 36, 36.6),
                DrugB_T2 = runif(4, 37, 38.5)
);df

  Name     DrugA_T1 DrugA_T2 DrugB_T1 DrugB_T2
1 John     35.07729 37.41580 36.17455 37.44987
2 Peter    35.01392 37.41355 36.00115 37.88969
3 Mary     35.67363 38.92508 36.49993 38.25544
4 Caroline 35.14321 36.52195 36.05723 38.08802

In [4]:
# "из широкого в длинный формат"

In [6]:
df <- gather(df, Variable, Temperature, -Name)

In [7]:
df

   Name     Variable Temperature
1  John     DrugA_T1 35.07729
2  Peter    DrugA_T1 35.01392
3  Mary     DrugA_T1 35.67363
4  Caroline DrugA_T1 35.14321
5  John     DrugA_T2 37.41580
6  Peter    DrugA_T2 37.41355
7  Mary     DrugA_T2 38.92508
8  Caroline DrugA_T2 36.52195
9  John     DrugB_T1 36.17455
10 Peter    DrugB_T1 36.00115
11 Mary     DrugB_T1 36.49993
12 Caroline DrugB_T1 36.05723
13 John     DrugB_T2 37.44987
14 Peter    DrugB_T2 37.88969
15 Mary     DrugB_T2 38.25544
16 Caroline DrugB_T2 38.08802

In [8]:
df <- separate(df, Variable, c("DrugType", "Time"), "_");df

   Name     DrugType Time Temperature
1  John     DrugA    T1   35.07729
2  Peter    DrugA    T1   35.01392
3  Mary     DrugA    T1   35.67363
4  Caroline DrugA    T1   35.14321
5  John     DrugA    T2   37.41580
6  Peter    DrugA    T2   37.41355
7  Mary     DrugA    T2   38.92508
8  Caroline DrugA    T2   36.52195
9  John     DrugB    T1   36.17455
10 Peter    DrugB    T1   36.00115
11 Mary     DrugB    T1   36.49993
12 Caroline DrugB    T1   36.05723
13 John     DrugB    T2   37.44987
14 Peter    DrugB    T2   37.88969
15 Mary     DrugB    T2   38.25544
16 Caroline DrugB    T2   38.08802

In [15]:
select(df, Time, Temperature)

   Time Temperature
1  T1   35.07729
2  T1   35.01392
3  T1   35.67363
4  T1   35.14321
5  T2   37.41580
6  T2   37.41355
7  T2   38.92508
8  T2   36.52195
9  T1   36.17455
10 T1   36.00115
11 T1   36.49993
12 T1   36.05723
13 T2   37.44987
14 T2   37.88969
15 T2   38.25544
16 T2   38.08802

In [16]:
select(df, 3:4)

   Time Temperature
1  T1   35.07729
2  T1   35.01392
3  T1   35.67363
4  T1   35.14321
5  T2   37.41580
6  T2   37.41355
7  T2   38.92508
8  T2   36.52195
9  T1   36.17455
10 T1   36.00115
11 T1   36.49993
12 T1   36.05723
13 T2   37.44987
14 T2   37.88969
15 T2   38.25544
16 T2   38.08802

In [17]:
select(df, starts_with("T"))

   Time Temperature
1  T1   35.07729
2  T1   35.01392
3  T1   35.67363
4  T1   35.14321
5  T2   37.41580
6  T2   37.41355
7  T2   38.92508
8  T2   36.52195
9  T1   36.17455
10 T1   36.00115
11 T1   36.49993
12 T1   36.05723
13 T2   37.44987
14 T2   37.88969
15 T2   38.25544
16 T2   38.08802

In [18]:
select(df, -Name, -DrugType)

   Time Temperature
1  T1   35.07729
2  T1   35.01392
3  T1   35.67363
4  T1   35.14321
5  T2   37.41580
6  T2   37.41355
7  T2   38.92508
8  T2   36.52195
9  T1   36.17455
10 T1   36.00115
11 T1   36.49993
12 T1   36.05723
13 T2   37.44987
14 T2   37.88969
15 T2   38.25544
16 T2   38.08802

In [19]:
# filter действует по строкам, select действует по колонками

In [20]:
filter(df, Temperature > 37, Name %in% c("John", "Mary"))

  Name DrugType Time Temperature
1 John DrugA    T2   37.41580
2 Mary DrugA    T2   38.92508
3 John DrugB    T2   37.44987
4 Mary DrugB    T2   38.25544

In [22]:
# arrange сортировка df по нескольким переменным одновременно
# - убывание

In [23]:
arrange(df, Name, -Temperature)

   Name     DrugType Time Temperature
1  Caroline DrugB    T2   38.08802
2  Caroline DrugA    T2   36.52195
3  Caroline DrugB    T1   36.05723
4  Caroline DrugA    T1   35.14321
5  John     DrugB    T2   37.44987
6  John     DrugA    T2   37.41580
7  John     DrugB    T1   36.17455
8  John     DrugA    T1   35.07729
9  Mary     DrugA    T2   38.92508
10 Mary     DrugB    T2   38.25544
11 Mary     DrugB    T1   36.49993
12 Mary     DrugA    T1   35.67363
13 Peter    DrugB    T2   37.88969
14 Peter    DrugA    T2   37.41355
15 Peter    DrugB    T1   36.00115
16 Peter    DrugA    T1   35.01392

In [24]:
arrange(df, -Temperature)

   Name     DrugType Time Temperature
1  Mary     DrugA    T2   38.92508
2  Mary     DrugB    T2   38.25544
3  Caroline DrugB    T2   38.08802
4  Peter    DrugB    T2   37.88969
5  John     DrugB    T2   37.44987
6  John     DrugA    T2   37.41580
7  Peter    DrugA    T2   37.41355
8  Caroline DrugA    T2   36.52195
9  Mary     DrugB    T1   36.49993
10 John     DrugB    T1   36.17455
11 Caroline DrugB    T1   36.05723
12 Peter    DrugB    T1   36.00115
13 Mary     DrugA    T1   35.67363
14 Caroline DrugA    T1   35.14321
15 John     DrugA    T1   35.07729
16 Peter    DrugA    T1   35.01392

In [25]:
# mutate - изменение переменной

In [26]:
mutate(df, DrugType = gsub("Drug", "", DrugType))

   Name     DrugType Time Temperature
1  John     A        T1   35.07729
2  Peter    A        T1   35.01392
3  Mary     A        T1   35.67363
4  Caroline A        T1   35.14321
5  John     A        T2   37.41580
6  Peter    A        T2   37.41355
7  Mary     A        T2   38.92508
8  Caroline A        T2   36.52195
9  John     B        T1   36.17455
10 Peter    B        T1   36.00115
11 Mary     B        T1   36.49993
12 Caroline B        T1   36.05723
13 John     B        T2   37.44987
14 Peter    B        T2   37.88969
15 Mary     B        T2   38.25544
16 Caroline B        T2   38.08802

In [27]:
# связка summarize and group by

In [28]:
summarize(group_by(df, Time),
         AvgTemp = mean(Temperature))

  Time AvgTemp
1 T1   35.70511
2 T2   37.74493

In [29]:
group_by(df, Time)

   Name     DrugType Time Temperature
1  John     DrugA    T1   35.07729
2  Peter    DrugA    T1   35.01392
3  Mary     DrugA    T1   35.67363
4  Caroline DrugA    T1   35.14321
5  John     DrugA    T2   37.41580
6  Peter    DrugA    T2   37.41355
7  Mary     DrugA    T2   38.92508
8  Caroline DrugA    T2   36.52195
9  John     DrugB    T1   36.17455
10 Peter    DrugB    T1   36.00115
11 Mary     DrugB    T1   36.49993
12 Caroline DrugB    T1   36.05723
13 John     DrugB    T2   37.44987
14 Peter    DrugB    T2   37.88969
15 Mary     DrugB    T2   38.25544
16 Caroline DrugB    T2   38.08802

In [31]:
test_df <- data.frame(first_name = c("Anton", "Igor"),
                      last_name = c("Antonov", "Lavrentev"),
                      email_address = c("aaa.antonov@", "sdfasd@"),
                      postal_address = c("some9988", "sdkfjslfj989"),
                      date_added = c("2021-04-01", "2021-04-02"))

In [34]:
test_df

  first_name last_name email_address postal_address date_added
1 Anton      Antonov   aaa.antonov@  some9988       2021-04-01
2 Igor       Lavrentev sdfasd@       sdkfjslfj989   2021-04-02

In [35]:
select(test_df, contains("name"), date_added)

  first_name last_name date_added
1 Anton      Antonov   2021-04-01
2 Igor       Lavrentev 2021-04-02

In [37]:
select(test_df, -3:-4)

  first_name last_name date_added
1 Anton      Antonov   2021-04-01
2 Igor       Lavrentev 2021-04-02

In [38]:
select(test_df, -contains("_add"))

  first_name last_name
1 Anton      Antonov
2 Igor       Lavrentev

In [39]:
test_df %>% select(c(1:2, 5))

  first_name last_name date_added
1 Anton      Antonov   2021-04-01
2 Igor       Lavrentev 2021-04-02

In [40]:
select(test_df, first_name, last_name, date_added)

  first_name last_name date_added
1 Anton      Antonov   2021-04-01
2 Igor       Lavrentev 2021-04-02

In [41]:
select(test_df, matches("_.{4,5}$"))

  first_name last_name date_added
1 Anton      Antonov   2021-04-01
2 Igor       Lavrentev 2021-04-02

In [1]:
# конвейеры: оператор %>%

In [13]:
df <- data.frame(type = c(1,1,2,2,3,3), value = c(5, 10, 50, 100, 7,7))

In [3]:
df

  type value
1 1      5
2 1     10
3 2     50
4 2    100
5 3      7
6 3      7

In [4]:
# вложенные вызовы

In [14]:
arrange(
    summarize(
    group_by(df, type),
    Total = sum(value)
    ),
    -Total
)

  type Total
1 2    150
2 1     15
3 3     14

In [15]:
a <- group_by(df, type)

In [16]:
b <- summarize(a, Total = sum(value))

In [17]:
c <- arrange(b, -Total)

In [18]:
a

  type value
1 1      5
2 1     10
3 2     50
4 2    100
5 3      7
6 3      7

In [20]:
b

  type Total
1 1     15
2 2    150
3 3     14

In [21]:
c

  type Total
1 2    150
2 1     15
3 3     14

In [22]:
# конвейер

In [24]:
df %>%
    group_by(type) %>%
    summarise(Total = sum(value)) %>%
    arrange(-Total)

  type Total
1 2    150
2 1     15
3 3     14

In [29]:
# 1-st approach

In [31]:
avian <- read.csv('avianHabitat.csv')

In [33]:
avian <- subset(avian, PDB > 0 & DBHt > 0, c("Site", "Observer", "PDB", "DBHt"))

In [35]:
str(avian)

'data.frame':	492 obs. of  4 variables:
 $ Site    : chr  "BunkerHill27" "BunkerHill27" "BunkerHill27" "BunkerHill27" ...
 $ Observer: chr  "RA" "RA" "RA" "RA" ...
 $ PDB     : int  3 2 4 3 4 3 3 2 2 2 ...
 $ DBHt    : num  5.2 3.1 5.5 6.2 5.4 4 5.2 4.4 5.7 4.8 ...

In [37]:
avian$Site <- factor(str_replace(avian$Site, "[:digit:]+", ""))

In [40]:
subset(
    aggregate(avian$DBHt, list(Site = avian$Site, Observer = avian$Observer), max),
    x >= 5
)

   Site        Observer x
1  BunkerHill  JT        9.9
3  BunkerHill  RA        7.0
5  HortonCreek RA       10.0
7  McAdamCreek RA        7.2
11 McAdamCreek RR        5.0

In [41]:
# 2-nd approach - using pipes

In [42]:
avian <- read.csv('avianHabitat.csv')

In [43]:
avian <- 
    avian %>%
    subset(PDB > 0 & DBHt > 0, c("Site", "Observer", "PDB", "DBHt")) %>%
    transform(Site = factor(str_replace(.$Site, "[:digit:]+", "")))

In [45]:
aggregate(avian$DBHt, list(Site = avian$Site, Observer = avian$Observer), max) %>%
    subset(x >= 5)

   Site        Observer x
1  BunkerHill  JT        9.9
3  BunkerHill  RA        7.0
5  HortonCreek RA       10.0
7  McAdamCreek RA        7.2
11 McAdamCreek RR        5.0

In [46]:
# third appoach (using both pipes and dplyr)

In [263]:
avian <- read.csv('avianHabitat.csv')

In [116]:
avian %>%
    filter(PDB > 0, DBHt > 0) %>%
    select(Site, Observer, contains("DB")) %>%
    mutate(Site = factor(str_replace(Site, "[:digit:]+", ""))) %>%
    group_by(Site, Observer) %>%
    summarise(MaxHt = max(DBHt)) %>%
    filter(MaxHt >= 5)

  Site        Observer MaxHt
1 BunkerHill  JT        9.9
2 BunkerHill  RA        7.0
3 HortonCreek RA       10.0
4 McAdamCreek RA        7.2
5 McAdamCreek RR        5.0

In [75]:
head(warpbreaks)

  breaks wool tension
1 26     A    L
2 30     A    L
3 54     A    L
4 25     A    L
5 70     A    L
6 52     A    L

In [76]:
warpbreaks %>%
    group_by(wool, tension) %>%
    summarize(avg = mean(breaks), max = max(breaks)) %>%
    filter(avg > 25 | max > 42)

  wool tension avg      max
1 A    L       44.55556 70
2 A    H       24.55556 43
3 B    L       28.22222 44
4 B    M       28.77778 42

In [275]:
avian <- read.csv('avianHabitat.csv')

In [277]:
avian <- avian %>%
    mutate(Site = factor(str_replace(Site, "[:digit:]+", ""))) %>%
    select(Site, Observer, contains("Ht")) %>%
    gather(Plant, Ht, -Site, -Observer) %>%
    filter(Ht > 0) %>%
    group_by(Site, Observer, Plant) %>%
    summarise_each(funs(length), Ht)

    
filter(avian, Site == 'McAdamCreek',Observer == 'RA', Plant== 'LHt')
filter(avian, Site == 'CreteCreek',Observer == 'RR', Plant== 'HHt')
filter(avian, Site == 'LivingstonCreek',Observer == 'RR', Plant== 'WHt')
filter(avian, Site == 'HortonCreek',Observer == 'RA', Plant== 'EHt')
filter(avian, Site == 'CreteCreek',Observer == 'RR', Plant== 'HHt')
filter(avian, Site == 'BunkerHill',Observer == 'JT', Plant== 'DBHt')

  Site        Observer Plant Ht
1 McAdamCreek RA       LHt   85

  Site       Observer Plant Ht
1 CreteCreek RR       HHt   80

  Site            Observer Plant Ht
1 LivingstonCreek RR       WHt   115

  Site        Observer Plant Ht
1 HortonCreek RA       EHt   116

  Site       Observer Plant Ht
1 CreteCreek RR       HHt   80

  Site       Observer Plant Ht
1 BunkerHill JT       DBHt  53

In [278]:
# Общий глоссарий для этого урока:

# Tidy data
# library(tidyr): ?gather, ?separate
# library(dplyr):
# ?select
# ?filter
# ?arrange
# ?mutate
# ?group_by, ?summarise
# ?"%>%", piping operator